#!/bin/sh

echo -e "\033[30;32m"

echo ""

echo "**********欢迎登陆本应用服务器***********"

echo " initialization.sh 查看系统初始化信息"

echo "******************************************"

echo "主机名："

hostname

echo "******************************************"

echo "本次登录的用户是："

whoami

echo "******************************************"

echo "系统时间："

date

echo "******************************************"

echo "系统运行时间及负载："

uptime

echo "******************************************"

echo "磁盘使用情况："

df -H

echo "******************************************"

echo "内存使用情况："

free -g

echo "******************************************"

echo "最近10次系统登录情况："

last -10

echo "******************************************"

echo "当前在线用户："

w

echo "******************************************"

echo "当前系统情况请输入命令top！"

echo "******************************************"

echo ""

echo -e "\033[0m"